using System;

namespace Discussion.Web.Services.ChatHistoryImporting
{
    public class DefaultNameGenerator : INameGenerator
    {
        public string GenerateName()
        {
            var random = new Random(Guid.NewGuid().GetHashCode());
            return _builtinNames[random.Next(0, _builtinNames.Length - 1)];
        }

        private readonly string[] _builtinNames =
        {
            "不鸣则已", "挽喜", "一鸣惊人", "带他滚","巴黎醉","素衣清颜淡若尘","哥超神","八戒你又淘气了","秋蝉撕心裂肺的喊叫","神1樣的男人","霸气十足","名字真难起","男人拽照样甩","年少时难免轻狂","恶妇","你的背影","酒里","独角戏子","独自演着双人戏","布丁和牛奶","别说尔爱俄","活著就是折磨","柔情装满哀痛","逆时光看不见我眼泪","浮花浪蕊为君留","葫芦娃","伤上三五年","学会装腔作势","中国好姑娘","莫斯科巷顶透出一缕暖阳","朂後①佽蕗過","今天我们相恋了","Hero Sky","土多啤梨","千江有水千江月","以你为荣","梦醒人走茶凉","古琵琶的爱情","我依旧很爱你","无处寄笺","可爱又迷人的反派角色","説菿疧莪衹嗳妳","黑白灰","地球人","年轻诠释我们的梦想","梦之队","休得无礼","单身成瘾","神仙道","仙人掌小姐","单身菇凉","哇咔咔","琉璃心","旧光影里的格子少年","枳飨詠逺相守","奢求这份爱","吴笨笨快回来","你的世界不缺我","恋他已久","花落","乌鲁我爱你","菇凉儿要霸气","三生石畔我独怜","bào走の少nv","ぉ掩蓋那段愛","Flame","烂故事","拼命菇凉","黑涩天空","良人未归","牵手手","倾城如梦未必阑珊","我比你妈还爱你","脚裸处绑情丝","眼泪回流","爱给了WHO","下一站去哪里→","镜中花水中月","空蝉星云","恋上ㄋ你的笑っ","回忆若然尘埃","回忆牵着走","左肩蝶舞","娘夠資格叫ni滾","甜心百分百","葬心仪式","春光倾人","未必美好","抹茶味的百奇","初音未来","朕很萌","谢谢你的存在","淡忘你的爱","致我们初中的班长","林中花雾仍未萧","萌萌大奇葩","九四少年","黑暗里的影子","狂奔的蜗牛","你给我的那把伞","青衣","乌衣巷","独孤他老人家","一地鸡毛","青花瓷器", "寒冷的夏季","心痛你奈我何","变态美少女","一袭红衣","蝴蝶結","將情蠱嘗個遍","女孩不哭","一米阳光","边贤伯","烟花春晓","绾长发","系统式结束","死宅","汨看迣鎅","放任时光飞逝却无能为力。","疾风魔影","白绢黑字君莫忘。","爸气外漏","何事秋风悲画","叫兽是只大萌兔","眸子里满是阴霾尘埃","喵了個咪","笑而不语","二凡十三郎","琉璃瓶的回忆","优酸乳2号","我知道我记得","一笑倾人城","深空","禁宫浮华殁","街拥","酌情忧伤","扰人安","DIE°","策白马啸西风","颇有姿色男人","唱一首沉默的歌","懒子汉","独奏我的歌","都不值得你屈就","时间会咬人","独身少年吼起来","微胖的女神@","囍笑","好一朵美丽的大奇葩","细碎流年","唐尸三摆手","眼涙一小滴","男生拽照样甩","把梦拆开","最难以面对","蓝色妖姬","激萌摇滚妹","妤笙","碎花落得满地倾城","抽空的太阳","麻饭","摔扁的企鹅","菓凍","我终于失去了你","气可鼓不可泄","好生俊俏","冭逼眞","月出东山之上","魔界之主","自信女人","我不配","星期一的闺女","想你的孩子","用烟来迷醉","你太碍眼","潇湘夜雨","川长思鸟来","汝为卿墨琴","浪的飞起","你挡我信号了"
        };
    }
}